test/data/xml/hikvision/GetAnalyticsModules.Request.xml

<?xml version="1.0" encoding="UTF-8"?>
<s:Envelope 
  xmlns:s="http://www.w3.org/2003/05/soap-envelope" 
  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" 
  xmlns:xsd="http://www.w3.org/2001/XMLSchema" 
  xmlns:wsa="http://www.w3.org/2005/08/addressing" 
  xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" 
  xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" 
  xmlns:tt="http://www.onvif.org/ver10/schema" 
  xmlns:ter="http://www.onvif.org/ver10/error" 
  xmlns:tns1="http://www.onvif.org/ver10/topics" 
  xmlns:axt="http://www.onvif.org/ver10/analytics" 
  xmlns:ttr="http://www.onvif.org/ver10/analytics/radiometry">
  <s:Header>
    <Security s:mustUnderstand="1" 
      xmlns="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
      <UsernameToken>
        <Username>admin</Username>
        <Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordDigest">lQ8khxWDI7zz5p9zS4Uhq0Tocas=</Password>
        <Nonce EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary">y7Nestcs3MPD7LNx3F5WIw==</Nonce>
        <Created 
          xmlns="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">2018-02-21T15:51:54.307Z
        </Created>
      </UsernameToken>
    </Security>
  </s:Header>
  <s:Body>
    <axt:GetAnalyticsModules>
      <axt:ConfigurationToken>VideoAnalyticsToken</axt:ConfigurationToken>
    </axt:GetAnalyticsModules>
  </s:Body>
</s:Envelope>